Repository: linux-ha-japan/doc-ja
Catalog: pacemaker-1.0-crm-cli/tm/pacemaker-1.0-crm-cli-level2.tmx
Source language: en_us
Languages: ja

source: Note that the apache template depends on a virtual IP address which is automatically pulled along.
ja: Apacheを実行するためには仮想IPも必要となります。テンプレートを使用してApacheの設定を作成すると自動的に仮想IPの設定も作成されます。

source: This level contains commands which show various information about the installed resource agents.
ja: raコマンドはリソースエージェントに関連する情報を表示します。

source: It is available both at the top level and the `configure` level.
ja: cibコマンドはCRM-CLIのトップレベルとconfigureレベルでのみ実行可能です。

source: The user may work on one of the shadow CIBs and then apply (or commit) it in a single step to the cluster.
ja: ユーザは複数のシャドウCIBを作成し、そのうちの一つをクラスタへ反映することができます。

source: Nodes and attributes describing nodes are managed using the `node` command.
ja: 例えば、nodeコマンドは、ノードの設定変更だけではなく、ノードの属性に関する設定変更を実行することができます。

source: Simply append the parameter value at the end of the line.
ja: 各行の最後尾にパラメータ値を追記してください。

source: Most commands consist of just a list of simple tokens.
ja: クラスタを管理するコマンドを実行する際、いくつかのオプションが必要となる場合もありますが、オプションはそれほど複雑ではありません。

source: The `clone` command creates a resource clone.
ja: clonrリソースを定義します。

source: The primitive command describes a resource.
ja: primitiveリソースを定義します。

source: Probe for resources not started by the CRM.
ja: reprobeコマンドはCRMを経由せずに起動したリソースのprobe処理を実行します。

source: Note also that the values given are just _advisory minimum_---your resources may require longer timeouts.
ja: meta-dataで推奨されている場合はあくまで最小のタイムアウト値です。特定の環境によってはさらに大きな値が必要となる場合もありますので注意してください。

source: Resets and clears the state of the specified node.
ja: clearnodestateコマンドは特定ノードの状態を削除します。

source: Semantic check of the CIB or elements modified or created may be done on every configuration change (`always`), when verifying (`on-verify`) or `never`.
ja: CIBの情報が変更された場合、どのタイミングでXMLの構文チェックを実行するかを設定することができます。設定値は、always, on-verify, neverのいずれかです。

source: One typical example is attribute generated by the `pingd` utility.
ja: 例えば、`pingd`リソースの属性などを編集することができます。

source: It is also possible to feed it a set of commands from standard input or a file, thus turning it into a scripting tool.
ja: 標準入力から一連のコマンドを連続して実行することも可能であり、操作をスクリプト化することもできます。

source: All changes made during this session are lost.
ja: 変更がcommitコマンドを使用してクラスタに反映されていない場合は、反映前の変更内容はすべて失われます。

source: The `list` command shows the just created `web` configuration, among other configurations (I hope that you, unlike me, will use more sensible and descriptive names).
ja: ここで`list`コマンドを実行すると、先ほど作成した「web」という名前の設定(Apache, 仮想IP)が表示されます。上記の例ではweb以外の設定も表示されていますが、これらは別の機会に作成した設定です。

source: Use that if you don't want to reference the set of operations elsewhere.
ja: オペレーションの設定を他のリソースから参照しない場合に使用します。

source: Resource definitions may be checked against the meta-data provided with the resource agents.
ja: リソースの定義については、リソースエージェントのmeta-dataに基づいて構文チェックが実行されます。

source: The changes applied to the current CIB only on ending the configuration session or using the `commit` command.
ja: 変更された設定は、configureレベルから別のレベルに移動したとき、または、commitコマンドが実行されたときにCIBに反映されます。

source: The new shadow CIB feature may also be put to use.
ja: 最近追加された新しい機能として、シャドウCIBがあります。

source: See also the <<cmdhelp_template,template section>>.
ja: 詳細は<<cmdhelp_template,template section>>を参照してください。

source: The CLI provides a consistent and unified interface to CIB/cluster management.
ja: CRM-CLIは、CIBの編集およびクラスタの管理を行うためのツールです。

source: Templates consist of a typical ready configuration which may be edited to suit particular user needs.
ja: テンプレートは典型的なクラスタの雛形です。ユーザはテンプレートの一部のパラメータを変更するだけで容易にクラスタを設定することができます。

source: It is possible to use a continuation character (`\`) to write one command in two or more lines.
ja: コマンドに複数のオプションを追加して文字列が長くなってしまった場合は、継続文字(`\`)を使用して改行することもできます。

source: If you want them appear in the order they were created, set this option to `no`.
ja: CIBの要素を作成された順序に従って表示したい場合、sort-elementsをnoに設定してください。

source: Show cluster status.
ja: statusコマンドはクラスタの状態を表示します。

source: As you can see, the parameter line format is very simple: ...............
ja: パラメータの設定方法は非常に単純です。パラメータの名前と値をスペースで区切って定義してください。 ...............

source: We will show here how to create a simple yet functional Apache configuration: ...............
ja: Apacheのテンプレートを利用した設定例 ...............

source: Enter edit and manage the CIB status section level.
ja: cibstatusコマンドはCIBのstatsuセクションを編集、管理します。

source: The command to perform the upgrade is: ...............
ja: updateコマンドは、内部的にcibadminコマンドを呼び出します。 ...............

source: The completion is both static (i.e. for `crm` commands) and dynamic.
ja: 入力補完は静的にも動的にも実行可能です。

source: The node command describes a cluster node.
ja: nodeコマンドでノードを定義することができます。

source: It may contain a single primitive resource or one group of resources.
ja: 一つのprimitiveリソース、または一つのgroupリソースで構成されます。

source: It may be used either as an interactive shell or for single commands directly on the shell's command line.
ja: CRM-CLIは、対話式の操作だけではなくバッチ入力方式にも対応しています。

source: The administrator may choose to apply any of them to the cluster, thus replacing the running configuration with the one which is in the shadow.
ja: 管理者は複数のシャドウCIBを作成し、そのうちの一つだけをクラスタに反映することができます。

source: It is modified _only_ on events, i.e. when some resource operation is run or node status changes.
ja: このセクションが保持する情報が変更されるのは、リソースのオペレーションが実行されたとき、ノードの状態が変更されたときに限られています。

source: The point of templates is to save you some typing.
ja: テンプレートとして提供されていた内容に加えて、ユーザ環境に依存するパラメータ値が正しく追加されていることを確認してください。

source: Load an existing configuration.
ja: loadコマンドは既存のテンプレートを読み込みます。

source: It may sometimes be of interest to see how status changes would affect the Policy Engine.
ja: cibstatusセクションが変更されるとPolicy Engineの挙動にどのような影響を与えるのかは興味深い点です。

source: There are three types of constraints:
ja: 制約の設定に使用するコマンドは次の通りです。

source: Commands for resources are:
ja: リソースの設定に使用するコマンドは次の通りです。

source: Here a few examples: ...............
ja: 実行例 ...............

source: .Note on `id-ref` usage **************************** Instance or meta attributes (`params` and `meta`) may contain a reference to another set of attributes.
ja: .備考 「id-ref」の使用方法 **************************** param属性やmeta属性は、他のリソースに設定された値を参照することができます。

source: === Shadow CIB usage
ja: === シャドウCIBの使用方法

source: List providers for a resource agent type.
ja: providerコマンドはリソースエージェントのproviderを表示します。

source: Copy the current cluster configuration into the shadow CIB.
ja: resetコマンドはシャドウCIBにライブCIBを上書きします。

source: By default, the current (`live`) status section is modified.
ja: デフォルトではライブCIBからstatusセクションを読み込みます。

source: Once the CIB file is found, it is copied to a shadow and this shadow is immediately available for use at both `configure` and `cibstatus` levels.
ja: CIBの情報が保存されたファイルが見つかると、シャドウCIBにファイルの内容がコピーされます。このシャドウCIBは`configure`レベルと`cibstatus`レベルで編集可能となります。

source: Leave the program.
ja: CRM-CLIを終了します。

source: If you are new to Pacemaker/CRM, templates may be the best way to start.
ja: Pacemakerをはじめて使用する場合は、まずテンプレートを利用してクラスタを設定してみましょう。

source: It uses the command line tools where possible and may resort to XML and `cibadmin` when there is no other option.
ja: CRM-CLIは内部で`cibadmin`コマンドのようなコマンドラインツールを呼び出しており、コマンドラインツールを通してXMLの編集が実行されます。

source: Usage is also inconsistent at times.
ja: また、コマンドラインツール間でプションが統一されていないものもあり、ユーザが混乱する原因になっています。(訳者注：Pacemaker 1.0.10以降では、オプションの統一が進んでいます。)

source: At this level resources may be managed.
ja: resourceコマンドを使用してリソースを管理することができます。

source: Brace yourself for some unreadable output.
ja: 出力された内容を理解するためニアh、XMLやCIBの知識が必要となります。

source: This essentially shows the latest `load` argument.
ja: 最新の設定が表示さえます。

source: By default, the CIB is replaced, unless the method is set to "update".
ja: デフォルトでは、updateオプションが使用されるためCIBは上書きされます。replaceオプションを指定した場合は、CIBは一度削除されたあと新しい設定が適用されます。

source: The `show` command, which displays the resulting configuration, may be used to get an idea about the minimum required changes which have to be done.
ja: `show`コマンドを実行すると、設定内容が表示されます。ユーザがそれぞれの環境にあわせて設定を変更する必要のあるパラメータは、エラーメッセージが表示されます。

source: The `(live)` string in the prompt signifies that the current CIB in use is the cluster live configuration.
ja: コマンドプロンプトに表示される`(live)`という文字列は、操作対象のCIBが実行中のクラスタ(ライブCIB)であることを表しています。

source: If the shadow name is omitted then the target shadow is named after the input CIB file.
ja: importコマンドの引数としてシャドウCIBの名前が省略された場合は、取り込まれたファイル名がシャドウCIBの名前となります。

source: Restart a resource.
ja: restartコマンドはリソースを再起動します。

source: If the node parameter is omitted then all nodes are shown.
ja: 引数が省略された場合、すべてのノードの状態が表示されます。

source: This command can be used to manually confirm that a node has been fenced (e.g., powered off).
ja: ノードがフェンスされた状態を手動で再現することができます。

source: The CIB may be specified as file or as a PE input file number.
ja: CIBの情報はPE(Policy Engine)からファイルに出力されています。

source: List existing configurations or templates.
ja: listコマンドは利用可能なテンプレートを表示します。

source: Due to this command entailing a whole set of operations, informational messages are printed to let the user see some progress.
ja: すべてのリソースが停止した後に起動処理が実行されます。このコマンドが複数の操作を実行するため、実行中にメッセージが出力されることがあります。

source: Failures in these checks are treated as configuration errors.
ja: 構文チェックでエラーとなった項目は、設定時にもエラーが出力されます。

source: These checks are currently carried out:
ja: 例えば、次のようなチェックが実行されます。

source: The user may also choose to see only objects which were changed.
ja: 変更された値のみを表示することも可能です。

source: The CLI should provide a means to manage the cluster efficiently or put together a configuration in a concise manner.
ja: CRM-CLIによって、クラスタを効率的に管理し、容易に設定を変更することができます。

source: You may want to change the color scheme and save it in the preferences file for other color setups.
ja: 色設定を保存する方法は、別の章を参考にしてください。

source: This constraint expresses the placement relation between two or more resources.
ja: clocationはリソースの同居制約を定義します。

source: Supply additional arguments for more information or different format.
ja: 引数を追加すると、詳細情報の表示や異なるフォーマットでの表示も可能です。

source: Several modes of operation are available to restrict the set of features depending on the user's proficiency.
ja: ユーザの習熟度に応じて使用可能な機能を限定することもできます。

source: The `help` command prints help for the current level or for the specified topic (command).
ja: helpコマンドは、現在のレベルで実行可能なコマンドや、コマンドのオプションについての情報を表示します。

source: For that you still need to execute the `commit` command.
ja: 設定内容をクラスタに反映するためには`commit`コマンドを実行する必要があります。

source: === Templates
ja: === テンプレート

source: Just set this option to `color,uppercase`.
ja: ここでは、colorとuppercaseを設定してみましょう。

source: The shell syntax for such sets is to put resources in parentheses.
ja: 括弧で囲まれたリソース間の依存関係が優先されます。次の例では、リソースB, Cの依存関係がAとの依存関係よりも優先されます。

source: You don't have to worry about that if you run `crm` as `root`.
ja: rootユーザでCRM-CLIを実行している場合は、ユーザの権限について意識する必要はありません。

source: If there are many nodes, the command may take a while.
ja: 多数のノードで構成されるクラスタの場合、コマンドの実行に時間がかかる可能性がありますので注意してください。

source: It is important, however, to understand the configuration produced.
ja: 上記の手順は基本的な設定手順となりますので、よく理解しておいてください。

source: The current status is never even written to disk, though it is available in the PE (Policy Engine) input files which represent the history of cluster motions.
ja: cibstatusセクションはディスク上のファイルには保存されません。

source: Each of these commands support one or more basic CIB objects.
ja: configureレベルのコマンドは、異なるCIBオブジェクトでも共通に使用できるものがあります。

source: They are designed in such a way, so that users may generate valid cluster configurations with minimum effort.
ja: ユーザはテンプレートを利用することによって、複雑な操作を行わずにクラスタを設定することができます。

source: Editing the CIB is a challenge, not only due to its complexity and a wide variety of options, but also because XML is more computer than user friendly.
ja: CIBは構文が複雑なので、CIBの情報を変更する手順はかなり煩雑です。

source: == Introduction to the user interface
ja: == ユーザインターフェースの概要

source: `crm` can show colors only if there is curses support for python installed (usually provided by the `python-curses` package).
ja: CRM-CLIの出力を色分けするためには、python-cursesがインストールされている必要があります。

source: This node is afterwards assumed clean and offline.
ja: このコマンドを実行すると、ノードの故障履歴などが削除され、オフライン状態となります。

source: Command line (one-shot) use:
ja: コマンドラインモード

source: Manage a resource using the `is-managed` attribute.
ja: manageコマンドはリソースを管理対象とみなします。

source: If the shell finds out that after the change it can digest it, then it is going to be converted into the normal configuration language.
ja: 手動編集によってXMLの構文が冗長になってしまった場合などは、CRM-CLIが自動的に通常の形式へ変換します。

source: Note that it is also possible to manage node attributes at the `node` level.
ja: ノードの属性値もこのコマンドで編集可能です。

source: The target resource of the apache template is a group which we named `websvc` in this sample session.
ja: 上記の手順で、Apacheと仮想IPを設定したgroupリソースを作成することができました。groupリソースの名前は`websvc`です。

source: A typical example is `OCF_CHECK_LEVEL`.
ja: オペレーションの属性値として典型的な例は`OCF_CHECK_LEVEL`です。

source: The parameter name `id` is set by default to the name of the configuration.
ja: パラメータのIDはデフォルトで設定名が使用されます。

source: `online`:: Set the `node_state` `crmd` attribute to `online` and the `expected` and `join` attributes to `member`.
ja: `online`:: node_state, crmdの属性をonlineへ変更します。また、expexted, joinの属性をmemberへ変更します。

source: The CLI is line oriented: every command must start and finish on the same line.
ja: CRM-CLIのコマンドは、基本的には、改行を含めずに実行してください。

source: The `crm` prompt always contains the name of the configuration which is currently in use.
ja: シャドウCIBの操作中は、コマンドプロンプトには現在操作を実行中のシャドウCIBの名前が表示されます。

source: This way you can tell CRM that it ran an operation and that the resource agent returned certain exit code.
ja: オペレーションが実行されると、通常はリソースエージェントから規定の返り値が戻されます。

source: Typically done after the resource has temporarily failed.
ja: このコマンドはリソースの故障が発生した後に、リソースの故障履歴を削除するために使用します。

source: At the top of the file, the user is advised how to make changes.
ja: ファイルの先頭に、変更が必要な項目が表示されます。

source: Arguably the most important aspect of such a program is the user interface.
ja: このツールも最も重要な部分はユーザインターフェースです。

source: This level enables all CIB object definition commands.
ja: configureレベルではCIBのオブジェクトに対して設定の変更を行います。

source: Finally, the configuration may be applied to the current crm configuration (note how the configuration changed slightly, though it is still equivalent, after being digested at the `configure` level): ...............
ja: では、いよいよ、設定した内容を適用させます。適用した内容は`template`レベルよりも一つ上の階層である`configure`レベルで確認することができます。 ...............

source: The `erase` clears all configuration.
ja: `erase`コマンドはCIBの「すべての」設定を削除します。

source: If you have graphviz installed and X11 session, `dotty(1)` is run to display the changes graphically.
ja: `ptest`コマンドの実行結果を図で表示するためには、graphvizをインストールする必要があります。X11環境で`ptest`コマンドを実行すると、dorryが実行され遷移グラフが表示されます。

source: If you want to rename a resource, it must be in the stopped state.
ja: リソースの名前を変更したい場合は、リソースが停止した状態でrenameコマンドを実行してください。

source: If there are multiple meta attributes sets, the attribute is set in all of them.
ja: startコマンドを実行すると`target-role`属性が設定されます。複数のmeta属性が存在する場合は、すべての属性が設定されます。

source: The status is displayed by `crm_mon`.
ja: `crm_mon`コマンドで表示される内容とほぼ同じものです。

source: All (or almost all) commands are implemented with the CRM tools such as `crm_resource(8)`.
ja: resourceコマンドによる操作は、`crm_resource`コマンドなどでも代替可能です。

source: Delete one or more objects.
ja: `delete`コマンドはオブジェクトを削除します。

source: Show/edit/delete a meta attribute of a resource.
ja: metaコマンドはリソースのmeta属性を表示、編集、削除します。

source: This configuration looks exactly as you could type it at the `configure` level.
ja: `configure`レベルで`show`コマンドを実行して表示された設定内容が

source: `unclean`:: Set the `node_state` `crmd` attribute to `offline` and the `expected` attribute to `member`.
ja: `unclean`:: node_state, crmdの属性をuncleanへ変更します。また、expextedの属性をmemberへ変更します。

source: Leave out the CIB name to switch to the running CIB.
ja: シャドウCIBが複数存在している場合、useコマンドを使用して編集中に別のシャドウCIBを選択することもできますし、ライブCIBを選択することもできます。

source: The `edit` command invokes an editor.
ja: editorコマンドはエディタを起動します。

source: That is the easiest way to ensure compatibility between different management tools.
ja: それぞれのコマンドラインツールから実行された結果は互換性を保持しています。

source: Edit current or given configuration using your favourite editor.
ja: editコマンドでエディタを起動し、テンプレートを編集することができます。

source: If you already know which parameters are required, you can set them directly on the command line.
ja: 必要なパラメータがすでにわかっている場合は、テンプレートを作成する段階で値を入力することができます。

source: Collocation resource sets have an extra attribute to allow for sets of resources which don't depend on each other in terms of state.
ja: 同居制約には依存関係の優先度を設定することができます。

source: The `group` command creates a group of resources.
ja: groupリソースを定義します。

source: The current status may be read using the `cibadmin -Q` command.
ja: cibstatusセクションの状態は、`cibadmin -Q`コマンドで表示することができます。

source: The loaded (active) configuration may be removed by force.
ja: 読み込まれた設定は強制的に削除されます。

source: - `new`: create a new configuration from templates - `edit`: define parameters, at least the required ones - `show`: see if the configuration is valid - `apply`: apply the configuration to the `configure` level
ja: - `new`: 新しいテンプレートを作成します。 - `edit`: ユーザの環境に合わせてパラメータ値を設定します。 - `show`: 設定内容を確認します。 - `apply`: `configure`レベルで、設定内容を適用します(まだクラスらには反映されていません)。

source: `crm` can adorn configurations in two ways: in color (similar to for instance the `ls --color` command) and by showing keywords in upper case.
ja: CRM-CLIにはコンソールの色設定も実装されています。文字を色分けして表示する機能と、キーワードを大文字で表示する機能が利用可能です。

source: There are currently three options to manage the CIB, listed here in a decreasing order of user-friendliness:
ja: 現在、CIBを編集するために下記のツールが提供されています。

source: It is possible to combine the latter two in order to get an upper case xmass tree.
ja: colorとuppercaseは組み合わせて使用することもできます。

source: List existing shadow CIBs.
ja: listコマンドはシャドウCIBの一覧を表示します。

source: Edit node attributes which are in the CIB status section, i.e. attributes which hold properties of a more volatile nature.
ja: status-attrコマンドはCIBに含まれるノードの属性(クラスタの実行中に変更される属性)を編集します。

source: We should also define the preferred node to run the service: ...............
ja: 次に、リソースが配置制約を設定します。配置制約は、クラスタの初期起動時に、どのノードでリソースが起動するかを定義することができます。 ...............

source: It may be referenced only once in group, clone, or master-slave objects.
ja: primitiveリソースは、groupリソースやcloneリソース、master/slaveリソースから参照されます。

source: Copy the current or given configuration to the current CIB.
ja: applyコマンドはテンプレートの内容をライブCIBに適用します。

source: Delete a node.
ja: deleteコマンドはノードの設定を削除します。

source: See `crm_mon(8)` for more details.
ja: 詳細は`crm_mon`コマンドのmanを参照してください。

source: Unless, of course, the origin is the running cluster.
ja: オリジナルのCIBとは実行中のクラスタが参照するライブCIBのことです。

source: In the former certain problems are treated as configuration errors.
ja: 構文チェックで誤りが発見された場合、デフォルトでは「エラー」レベルでメッセージが出力されますが、

source: Sometimes though, the administrator may start working with the running configuration, but change mind and instead of committing the changes to the cluster save them to a shadow CIB.
ja: クラスタを設定する際、最初はライブCIBを直接編集することが多いかもしれませんが、慣れてきたらまずシャドウCIBで設定を変更し、設定内容が間違っていないことを確認してからクラスタに反映するとよいでしょう。

source: === Tab completion
ja: === タブキーによる入力補完について

source: We define a small and simple language.
ja: CRM-CLIによるクラスタの設定手順は非常にシンプルです。

source: - the GUI (`hb_gui`) - a set of command line tools - `cibadmin(8)`
ja: - GUI - コマンドラインツール(`crm_resource`など) - `cibadminコマンド`

source: Stop a resource using the `target-role` attribute.
ja: stopコマンドはリソースを停止します。

source: The `ms` command creates a master/slave resource type.
ja: master/slaveリソースを定義します。

source: The file may be a CLI file or an XML file.
ja: ファイルの形式はCLIまたはXMLです。

source: When that happens, please file a bug report.
ja: 不具合を見つけたらバグレポートを提出してください。

source: It is also possible to change the operation's status.
ja: オペレーションの状態(op_status)を変更することも可能です。

source: Promote a master-slave resource using the `target-role` attribute.
ja: promoteコマンドはリソースをスレーブ状態からマスター状態へプロモート(昇格)します。

source: The `end` command ends the current level and the user moves to the parent level.
ja: endコマンドは現在のレベルを終了して、一つ上のレベルへ移動します。

source: The shell is first going to wait for the stop to finish, that is for all resources to really stop, and only then to order the start action.
ja: リソースが完全に停止するまでコマンドは待機状態となります。

source: To start with an empty configuration that is not copied from the live CIB, specify the `empty` keyword.
ja: シャドウCIBをライブCIBからではなく、全く空の状態亜kら作成する場合は、`empty`を指定してください。

source: Finally, there are the cluster properties, resource meta attributes defaults, and operations defaults.
ja: クラスタ全体の挙動を設定するためのクラスタプロパティやリソースのメタ属性、オペレーションのデフォルト値などをも編集することができます。

source: No such stonith resources, no fencing will happen.
ja: STONITHリソースが設定されていない場合は、フェンス処理も実行されません・

source: List available resource agents for the given class.
ja: listコマンドは利用可能なリソースエージェントを表示します。

source: As with the `show` command, the user may choose to edit all objects or a set of objects.
ja: `show`コマンドを同様に、すべての設定値を一括で編集することもできますし、特定の値のみ編集することもできます。

source: This constraint expresses the order of actions on two resources or more resources.
ja: orderはリソースの順序制約を定義します。

source: Set the cluster (`crm_config`) options.
ja: propertyコマンドはクラスタの全体的な設定を行います。CIBのcrm_configセクションに値が保持されます。

source: We enter the `template` level from `configure`.
ja: 最初に`configure`レベルに移動して`template`コマンドを実行してください。

source: Show nodes' status.
ja: statusコマンドはノードの状態を表示します。

source: The latter takes into account the current status of the cluster or information from installed resource agents.
ja: 後者はクラスらの状態やリソースエージェントの情報を取得するために必要となります。

source: See <<SEMCHK,Configuration semantic checks>> for more details.
ja: 詳細は<<SEMCHK,Configuration semantic checks>>を参照してください。

source: The CLI may also be used for the CIB description and generation.
ja: CRM-CLIを操作することによって、CIBそのものを生成することもできます。

source: This command enters a template level where additional commands for configuration/template management are available.
ja: このコマンドはtemplateレベルだけではなく、configurationレベルのさらに下の階層(configuration/template)でも実行可能です。

source: To summarize, working with templates typically consists of the following steps:
ja: これまでの手順をおさらいしてみましょう。クラスタの設定を行うためには次の手順が必要です。

source: Be careful!
ja: 注意！

source: Very difficult to use without extensive training.
ja: しかし、`cibadmin`コマンドは操作が難しいため、かなり経験を積んだユーザにしか使いこなせないかもしれません。

source: .Note ************************** Even though all sensible configurations (and most of those that are not) are going to be supported by the CLI, I suspect that it may still happen that certain XML constructs may confuse the tool.
ja: .備考 ************************ クラスタの管理は全てCRM-CLIで実行可能となるように開発が続けられていますが、特定のXMLに関してはまだ対応できていない箇所もあります。

source: This command invokes the editor with the object description.
ja: `edit`コマンドを実行するとエディタが起動します。

source: Set a node to online status.
ja: onlineコマンドはノードをオンライン化します。

source: Templates with ready made configurations may help people to learn about the cluster configuration or facilitate testing procedures.
ja: クラスタの設定や管理に慣れていないユーザのために、テンプレートも用意されています。

source: The user may set various options for the CLI program itself.
ja: optionsコマンドを使用して、CRM-CLIの各種オプションを設定することができます。

source: The timeouts for operations should be at least as long as those recommended in the meta-data.
ja: オペレーションのタイムアウト値は、meta-dataに記述された推奨値よりも大きな値を設定したほうがよいでしょう。

source: It is possible to add it without editing the whole resource.
ja: リソースの設定に、monitorオペレーションのみを追加することもできます。

source: In case the operation status is set to something other than `done`, the exit code is effectively ignored.
ja: オペレーションの状態をdone以外に設定する場合は、リソースエージェントからの返り値は無視されます。

source: For example, the `web` configuration we created above has the following required and optional parameters (all parameter lines start with `%%`): ...............
ja: 先ほどの設定(設定名 web)の場合、変更する必要のあるパラメータの接頭辞に `%%` が追加されています。 ...............

source: The set of `cibstatus` level commands allow the user to load status sections from various sources and then mimic resource operations or node changes.
ja: cibstatsuレベルで提供されているコマンドは、CIBのstatusセクションに保持された様々な値を表示します。
